<a href="https://colab.research.google.com/github/Vitorg-ux/Project2020/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Università degli studi di Milano-Bicocca
# Laurea Magistrale in Data Science
# Foundations of Computer Science (2021-1-F9101Q001)

[University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv)

Importazione delle librerie.

In [1]:
import pandas as pd
import re
import numpy as np

Importazione del dataset "timesData.csv", specificando che la virgola viene utilizzata come separatore per le migliaia, in modo che i dati contenuti nella colonna "num_students" vengano letti correttamente.

In [2]:
times = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/timesData.csv', thousands = ',', na_values = '-')
times.head()

  world_rank                        university_name  ... female_male_ratio  year
0          1                     Harvard University  ...               NaN  2011
1          2     California Institute of Technology  ...           33 : 67  2011
2          3  Massachusetts Institute of Technology  ...           37 : 63  2011
3          4                    Stanford University  ...           42 : 58  2011
4          5                   Princeton University  ...           45 : 55  2011

[5 rows x 14 columns]

Importazione del dataset "ShanghaiData.csv".

In [3]:
shanghai = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/shanghaiData.csv')
shanghai.head()

  world_rank                              university_name  ...   pcp  year
0          1                           Harvard University  ...  72.4  2005
1          2                      University of Cambridge  ...  66.9  2005
2          3                          Stanford University  ...  65.0  2005
3          4           University of California, Berkeley  ...  52.7  2005
4          5  Massachusetts Institute of Technology (MIT)  ...  53.0  2005

[5 rows x 11 columns]

Importazione del dataset "cwurData.csv".

In [4]:
cwur = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/cwurData.csv')
cwur.head()

   world_rank                            institution  ...   score  year
0           1                     Harvard University  ...  100.00  2012
1           2  Massachusetts Institute of Technology  ...   91.67  2012
2           3                    Stanford University  ...   89.50  2012
3           4                University of Cambridge  ...   86.17  2012
4           5     California Institute of Technology  ...   85.21  2012

[5 rows x 14 columns]

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

Creazione del dataframe "times_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "times".

In [5]:
times_most_recent = times.loc[times.groupby('university_name')['year'].idxmax()]
times_most_recent.head()

     world_rank  ...  year
2405    601-800  ...  2016
2003    201-250  ...  2016
2056    251-300  ...  2016
1908       =106  ...  2016
2105    301-350  ...  2016

[5 rows x 14 columns]

Creazione del dataframe "times_least_recent", contenente i dati meno recenti (ossia associati al minimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "times".

In [6]:
times_least_recent = times.iloc[times.groupby('university_name')['year'].idxmin()]
times_least_recent.head()

     world_rank  ...  year
2405    601-800  ...  2016
501     301-350  ...  2012
502     301-350  ...  2012
166         167  ...  2011
476     276-300  ...  2012

[5 rows x 14 columns]

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

Creazione del dataframe "times_least_most_recent" effettuando un join dei dataframe "times_least_recent" e "times_most_recent".

In [7]:
times_least_most_recent = pd.merge(times_least_recent[['university_name', 'year', 'income']], times_most_recent[['university_name', 'year', 'income']], on = ['university_name'], suffixes = ('_least_recent', '_most_recent'))
times_least_most_recent.head()

                            university_name  ...  income_most_recent
0  AGH University of Science and Technology  ...                 NaN
1                        Aalborg University  ...                43.7
2                          Aalto University  ...                61.6
3                         Aarhus University  ...                68.3
4                    Aberystwyth University  ...                31.3

[5 rows x 5 columns]

Calcolo del miglioramento di reddito ("income_most_recent" - "income_least_recent") tra i dati più recenti e quelli meno recenti per ciascuna università.

In [8]:
times_least_most_recent['improvement'] = pd.to_numeric(times_least_most_recent['income_most_recent']) - pd.to_numeric(times_least_most_recent['income_least_recent'])
times_least_most_recent.head()

                            university_name  ...  improvement
0  AGH University of Science and Technology  ...          NaN
1                        Aalborg University  ...          7.3
2                          Aalto University  ...         -0.3
3                         Aarhus University  ...          6.8
4                    Aberystwyth University  ...         -4.2

[5 rows x 6 columns]

### 3. Find the university with the largest increase computed in the previous point

In [9]:
times_least_most_recent[times_least_most_recent['improvement'] >= times_least_most_recent['improvement'].max()]

    university_name  year_least_recent  ...  income_most_recent  improvement
428      TU Dresden               2012  ...                99.7         67.8

[1 rows x 6 columns]

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

Creazione del dataframe "shanghai_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "shanghai".

In [10]:
shanghai_most_recent = shanghai.iloc[shanghai.groupby('university_name').idxmax()['year']]
shanghai_most_recent.head()

     world_rank           university_name national_rank  ...   pub   pcp  year
4697    301-400        Aalborg University             5  ...  30.4  16.8  2015
4797    401-500          Aalto University           4-6  ...  33.4  17.0  2015
4469         73         Aarhus University             2  ...  51.8  31.0  2015
4497    101-150  Aix Marseille University           5-6  ...  50.1  27.6  2015
3115    102-150  Aix-Marseille University           4-6  ...  44.3  15.3  2011

[5 rows x 11 columns]

Ridenominazione della colonna "institution" del dataframe "cwur" in "university_name".

In [11]:
cwur.rename(columns = {'institution' : 'university_name'}, inplace = True)

Creazione del dataframe "cwur_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "cwur".

In [12]:
cwur_most_recent = cwur.iloc[cwur.groupby('university_name').idxmax()['year']]
cwur_most_recent.head()

      world_rank                           university_name  ...  score  year
1981         782  AGH University of Science and Technology  ...  44.26  2015
1764         565                        Aalborg University  ...  44.59  2015
1620         421                          Aalto University  ...  45.10  2015
1321         122                         Aarhus University  ...  49.65  2015
2013         814                    Aberystwyth University  ...  44.22  2015

[5 rows x 14 columns]

Creazione del dataframe "most_recent_ranking", costruito effettuando il join dei dataframe "times_most_recent", "shanghai_most_recent" e "cwur_most_recent".

In [13]:
most_recent_ranking = pd.merge(times_most_recent[['university_name', 'world_rank']], shanghai_most_recent[['university_name', 'world_rank']], on = ['university_name'], suffixes = ('_intervals_times', '_intervals_shanghai'))
most_recent_ranking = pd.merge(most_recent_ranking, cwur_most_recent[['university_name', 'world_rank']], on = ['university_name'])
most_recent_ranking.rename(columns = {'world_rank' : 'world_rank_cwur'}, inplace = True)
most_recent_ranking.head()

                        university_name  ... world_rank_cwur
0                    Aalborg University  ...             565
1                      Aalto University  ...             421
2                     Aarhus University  ...             122
3              Aix-Marseille University  ...             206
4  Aristotle University of Thessaloniki  ...             459

[5 rows x 4 columns]

In [14]:
interval_times = most_recent_ranking['world_rank_intervals_times'].str.extract('(\d+)\-?(\d*)')
interval_times[0] = pd.to_numeric(interval_times[0])
interval_times[1] = pd.to_numeric(interval_times[1])
most_recent_ranking['world_rank_times'] = np.nanmean(interval_times, axis = 1).round()
most_recent_ranking.head()

                        university_name  ... world_rank_times
0                    Aalborg University  ...            226.0
1                      Aalto University  ...            276.0
2                     Aarhus University  ...            106.0
3              Aix-Marseille University  ...            276.0
4  Aristotle University of Thessaloniki  ...            700.0

[5 rows x 5 columns]

In [15]:
interval_shanghai = most_recent_ranking['world_rank_intervals_shanghai'].str.extract('(\d+)\-?(\d*)')
interval_shanghai[0] = pd.to_numeric(interval_shanghai[0])
interval_shanghai[1] = pd.to_numeric(interval_shanghai[1])
most_recent_ranking['world_rank_shanghai'] = np.nanmean(interval_shanghai, axis = 1).round()
most_recent_ranking.head()

                        university_name  ... world_rank_shanghai
0                    Aalborg University  ...               350.0
1                      Aalto University  ...               450.0
2                     Aarhus University  ...                73.0
3              Aix-Marseille University  ...               126.0
4  Aristotle University of Thessaloniki  ...               450.0

[5 rows x 6 columns]

In [16]:
most_recent_ranking['max_difference'] = most_recent_ranking[['world_rank_times','world_rank_shanghai', 'world_rank_cwur']].astype(int).max(axis = 1) - most_recent_ranking[['world_rank_times','world_rank_shanghai', 'world_rank_cwur']].astype(int).min(axis = 1)
most_recent_ranking[['university_name', 'world_rank_times','world_rank_shanghai', 'world_rank_cwur', 'max_difference']]

                          university_name  ...  max_difference
0                      Aalborg University  ...             339
1                        Aalto University  ...             174
2                       Aarhus University  ...              49
3                Aix-Marseille University  ...             150
4    Aristotle University of Thessaloniki  ...             250
..                                    ...  ...             ...
357                       Yale University  ...               1
358                    Yeshiva University  ...              86
359                     Yonsei University  ...             228
360                       York University  ...             124
361                   Zhejiang University  ...             150

[362 rows x 5 columns]

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country

Creazione del dataframe "times_most_recent_f_m" a partire dalle colonne "university_name", "country", "num_students" e "female_male_ratio" del dataframe "times_most_recent".

In [17]:
times_most_recent_f_m = times_most_recent[['university_name', 'country', 'num_students', 'female_male_ratio']].dropna(subset = ['female_male_ratio', 'num_students']).copy()
times_most_recent_f_m.head()

                 university_name  ... female_male_ratio
2003          Aalborg University  ...           48 : 52
2056            Aalto University  ...           32 : 68
1908           Aarhus University  ...           54 : 46
2105      Aberystwyth University  ...           48 : 52
2404  Adam Mickiewicz University  ...           71 : 29

[5 rows x 4 columns]

Controllo che la somma di female e male sia 100.

In [18]:
check = times_most_recent_f_m['female_male_ratio'].str.extract(r'(\d+) : (\d+)')
check['check'] = check[0].astype(int) + check[1].astype(int) - 100
check['check'].sum()

0

Creazione della colonna "females_percentage", contenente la percentuale di femmine per ciascuna università.

In [19]:
times_most_recent_f_m['females'] = times_most_recent_f_m['female_male_ratio'].str.extract('^(\d+)')
times_most_recent_f_m['females'] = round(pd.to_numeric(times_most_recent_f_m['females']) * times_most_recent_f_m['num_students'] / 100)
times_most_recent_f_m.head()

                 university_name         country  ...  female_male_ratio  females
2003          Aalborg University         Denmark  ...            48 : 52   8363.0
2056            Aalto University         Finland  ...            32 : 68   5152.0
1908           Aarhus University         Denmark  ...            54 : 46  12903.0
2105      Aberystwyth University  United Kingdom  ...            48 : 52   4441.0
2404  Adam Mickiewicz University          Poland  ...            71 : 29  28849.0

[5 rows x 5 columns]

Creazione della colonna "males_percentage", contenente la percentuale di maschi per ciascuna università.

In [20]:
times_most_recent_f_m['males'] = times_most_recent_f_m['female_male_ratio'].str.extract('(\d+)$')
times_most_recent_f_m['males'] = round(pd.to_numeric(times_most_recent_f_m['males']) * times_most_recent_f_m['num_students'] / 100)
times_most_recent_f_m.head()

                 university_name         country  ...  females    males
2003          Aalborg University         Denmark  ...   8363.0   9059.0
2056            Aalto University         Finland  ...   5152.0  10947.0
1908           Aarhus University         Denmark  ...  12903.0  10992.0
2105      Aberystwyth University  United Kingdom  ...   4441.0   4811.0
2404  Adam Mickiewicz University          Poland  ...  28849.0  11784.0

[5 rows x 6 columns]

Calcolo del numero totale di studentesse e di quello di studenti per ciascun paese.

In [21]:
times_most_recent_f_m.groupby('country', as_index = False).sum()[['country', 'females', 'males']]

                     country    females      males
0                  Argentina    67191.0    41182.0
1                  Australia   391736.0   321640.0
2                    Austria    68364.0    66113.0
3                 Bangladesh    21323.0    41393.0
4                    Belarus    20219.0     9084.0
..                       ...        ...        ...
65                    Uganda    18670.0    18670.0
66                   Ukraine    17846.0    19250.0
67      United Arab Emirates     9516.0     4931.0
68            United Kingdom   711814.0   613028.0
69  United States of America  1601453.0  1556324.0

[70 rows x 3 columns]

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

Creazione della colonna "ratio", contenente il rapporto tra femmine e maschi per ciascuna università.

In [22]:
times_most_recent_f_m['ratio'] = times_most_recent_f_m['females'] / times_most_recent_f_m['males']
times_most_recent_f_m.head()

                 university_name         country  ...    males     ratio
2003          Aalborg University         Denmark  ...   9059.0  0.923170
2056            Aalto University         Finland  ...  10947.0  0.470631
1908           Aarhus University         Denmark  ...  10992.0  1.173854
2105      Aberystwyth University  United Kingdom  ...   4811.0  0.923093
2404  Adam Mickiewicz University          Poland  ...  11784.0  2.448150

[5 rows x 7 columns]

Calcolo del rapporto medio tra femmine e maschi su tutte le università.

In [23]:
avg_ratio = times_most_recent_f_m['females'].sum() / times_most_recent_f_m['males'].sum()
avg_ratio

1.070989873395366

Estrazione delle università caratterizzate da un rapporto tra femmine e maschi minore di quello medio.

In [24]:
below_avg_f_m_ratio = times_most_recent_f_m[times_most_recent_f_m['ratio'] < avg_ratio]
below_avg_f_m_ratio.head()

             university_name         country  ...    males     ratio
2003      Aalborg University         Denmark  ...   9059.0  0.923170
2056        Aalto University         Finland  ...  10947.0  0.470631
2105  Aberystwyth University  United Kingdom  ...   4811.0  0.923093
2406         Ajou University     South Korea  ...   8513.0  0.492541
2408   Alexandria University           Egypt  ...  68813.0  0.851845

[5 rows x 7 columns]

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country)

Creazione del dataframe "total_students_in_country", contenente il numero totale di studenti per ogni paese.

In [25]:
total_students_in_country = times_most_recent.groupby('country', as_index = False).sum()[['country', 'num_students']]
total_students_in_country.rename(columns = {'num_students' : 'total_students'}, inplace = True)
total_students_in_country.head()

      country  total_students
0   Argentina        108373.0
1   Australia        743627.0
2     Austria        134477.0
3  Bangladesh         62716.0
4     Belarus         29303.0

Creazione del dataframe "students_in_country_below_avg" che, per ciascun paese, indica il numero di studenti che frequentano un'università caratterizzata da un rapporto tra femmine e maschi minore di quello medio.

In [26]:
students_in_country_below_avg = below_avg_f_m_ratio.groupby('country', as_index = False).sum()[['country', 'num_students']]
students_in_country_below_avg.head()

      country  num_students
0   Australia      146235.0
1     Austria       61033.0
2  Bangladesh       62716.0
3      Brazil      278774.0
4      Canada       86779.0

Creazione del dataframe "students_in_country", che costituisce il join dei dataframe "students_in_country_below_avg" e "total_students_in_country".

In [27]:
students_in_country = pd.merge(students_in_country_below_avg, total_students_in_country, on = ['country'])
students_in_country.head()

      country  num_students  total_students
0   Australia      146235.0        743627.0
1     Austria       61033.0        134477.0
2  Bangladesh       62716.0         62716.0
3      Brazil      278774.0        534688.0
4      Canada       86779.0        717054.0

Calcolo del rapporto tra il numero di studenti che frequentano un'università caratterizzata da un rapporto tra femmine e maschi minore di quello medio e il numero di studenti totali per ciascun paese.

In [28]:
students_in_country['ratio'] = students_in_country['num_students'] / students_in_country['total_students']
students_in_country.head()

      country  num_students  total_students     ratio
0   Australia      146235.0        743627.0  0.196651
1     Austria       61033.0        134477.0  0.453855
2  Bangladesh       62716.0         62716.0  1.000000
3      Brazil      278774.0        534688.0  0.521377
4      Canada       86779.0        717054.0  0.121022

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [29]:
attainment = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/educational_attainment_supplementary_data.csv')
attainment.dropna(subset = ['country_name', 'series_name'], inplace = True)
attainment.head()

  country_name                                        series_name  ...  2013  2015
0  Afghanistan  Barro-Lee: Average years of primary schooling,...  ...   NaN   NaN
1  Afghanistan  Barro-Lee: Average years of primary schooling,...  ...   NaN   NaN
2  Afghanistan  Barro-Lee: Average years of primary schooling,...  ...   NaN   NaN
3  Afghanistan  Barro-Lee: Average years of primary schooling,...  ...   NaN   NaN
4  Afghanistan  Barro-Lee: Average years of primary schooling,...  ...   NaN   NaN

[5 rows x 29 columns]

In [30]:
attainment[attainment['country_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

In [31]:
attainment[attainment['series_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [32]:
unpivoted_attainment = pd.melt(attainment, id_vars=['country_name', 'series_name'], var_name = 'year')
unpivoted_attainment

        country_name  ... value
0        Afghanistan  ...  0.33
1        Afghanistan  ...  1.03
2        Afghanistan  ...  0.83
3        Afghanistan  ...  2.34
4        Afghanistan  ...  0.54
...              ...  ...   ...
2134345     Zimbabwe  ...   NaN
2134346     Zimbabwe  ...   NaN
2134347     Zimbabwe  ...   NaN
2134348     Zimbabwe  ...   NaN
2134349     Zimbabwe  ...   NaN

[2134350 rows x 4 columns]

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking)

In [33]:
universities_times = pd.Series(times['university_name'].unique())
universities_shanghai = pd.Series(shanghai['university_name'].unique())
universities_cwur = pd.Series(cwur['university_name'].unique())
number_of_rankinkgs = pd.concat([universities_times, universities_shanghai, universities_cwur]) 
number_of_rankinkgs.value_counts()

University of North Carolina at Chapel Hill        3
Aalborg University                                 3
Drexel University                                  3
Nanyang Technological University                   3
Harbin Institute of Technology                     3
                                                  ..
Hunan Normal University                            1
Federal University of Santa Maria                  1
University of Missouri–Kansas City                 1
University of Arkansas - Fayetteville              1
Pennsylvania State University - University Park    1
Length: 1452, dtype: int64

### 11. In the times ranking, compute the number of times each university appears

In [34]:
number_times = times.groupby('university_name').size()
number_times.head()

university_name
AGH University of Science and Technology    1
Aalborg University                          5
Aalto University                            5
Aarhus University                           6
Aberystwyth University                      5
dtype: int64

### 12. Find the universities that appear at most twice in the times ranking¶

In [35]:
number_times[number_times <= 2]

university_name
AGH University of Science and Technology    1
Adam Mickiewicz University                  1
Aix-Marseille University                    1
Ajou University                             1
Alexandru Ioan Cuza University              1
                                           ..
Yokohama City University                    1
Yokohama National University                1
Yuan Ze University                          2
Yıldız Technical University                 1
Örebro University                           1
Length: 408, dtype: int64

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year)

Selezione dei dati contenuti nei dataframe "times" e "shanghai" in cui l'espressione della posizione nel ranking non è espressa mediante un intervallo.

In [36]:
times[times['world_rank'].str.contains('-')]['world_rank'].unique()

array(['201-225', '226-250', '251-275', '276-300', '301-350', '350-400',
       '351-400', '201-250', '251-300', '401-500', '501-600', '601-800'],
      dtype=object)

In [37]:
shanghai[shanghai['world_rank'].str.contains('-')]['world_rank'].unique()

array(['101-152', '153-202', '203-300', '301-400', '401-500', '102-150',
       '151-200', '201-300', '151-202', '203-304', '305-402', '403-510',
       '101-151', '152-200', '201-302', '303-401', '402-503', '402-501',
       '101-150'], dtype=object)

In [38]:
cwur['world_rank'].unique()

array([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,
         12,   13,   14,   15,   16,   17,   18,   19,   20,   21,   22,
         23,   24,   25,   26,   27,   28,   29,   30,   31,   32,   33,
         34,   35,   36,   37,   38,   39,   40,   41,   42,   43,   44,
         45,   46,   47,   48,   49,   50,   51,   52,   53,   54,   55,
         56,   57,   58,   59,   60,   61,   62,   63,   64,   65,   66,
         67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,
         78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,
         89,   90,   91,   92,   93,   94,   95,   96,   97,   98,   99,
        100,  101,  102,  103,  104,  105,  106,  107,  108,  109,  110,
        111,  112,  113,  114,  115,  116,  117,  118,  119,  120,  121,
        122,  123,  124,  125,  126,  127,  128,  129,  130,  131,  132,
        133,  134,  135,  136,  137,  138,  139,  140,  141,  142,  143,
        144,  145,  146,  147,  148,  149,  150,  151,  152,  153,  154,
        155,  156,  157,  158,  159,  160,  161,  162,  163,  164,  165,
        166,  167,  168,  169,  170,  171,  172,  173,  174,  175,  176,
        177,  178,  179,  180,  181,  182,  183,  184,  185,  186,  187,
        188,  189,  190,  191,  192,  193,  194,  195,  196,  197,  198,
        199,  200,  201,  202,  203,  204,  205,  206,  207,  208,  209,
        210,  211,  212,  213,  214,  215,  216,  217,  218,  219,  220,
        221,  222,  223,  224,  225,  226,  227,  228,  229,  230,  231,
        232,  233,  234,  235,  236,  237,  238,  239,  240,  241,  242,
        243,  244,  245,  246,  247,  248,  249,  250,  251,  252,  253,
        254,  255,  256,  257,  258,  259,  260,  261,  262,  263,  264,
        265,  266,  267,  268,  269,  270,  271,  272,  273,  274,  275,
        276,  277,  278,  279,  280,  281,  282,  283,  284,  285,  286,
        287,  288,  289,  290,  291,  292,  293,  294,  295,  296,  297,
        298,  299,  300,  301,  302,  303,  304,  305,  306,  307,  308,
        309,  310,  311,  312,  313,  314,  315,  316,  317,  318,  319,
        320,  321,  322,  323,  324,  325,  326,  327,  328,  329,  330,
        331,  332,  333,  334,  335,  336,  337,  338,  339,  340,  341,
        342,  343,  344,  345,  346,  347,  348,  349,  350,  351,  352,
        353,  354,  355,  356,  357,  358,  359,  360,  361,  362,  363,
        364,  365,  366,  367,  368,  369,  370,  371,  372,  373,  374,
        375,  376,  377,  378,  379,  380,  381,  382,  383,  384,  385,
        386,  387,  388,  389,  390,  391,  392,  393,  394,  395,  396,
        397,  398,  399,  400,  401,  402,  403,  404,  405,  406,  407,
        408,  409,  410,  411,  412,  413,  414,  415,  416,  417,  418,
        419,  420,  421,  422,  423,  424,  425,  426,  427,  428,  429,
        430,  431,  432,  433,  434,  435,  436,  437,  438,  439,  440,
        441,  442,  443,  444,  445,  446,  447,  448,  449,  450,  451,
        452,  453,  454,  455,  456,  457,  458,  459,  460,  461,  462,
        463,  464,  465,  466,  467,  468,  469,  470,  471,  472,  473,
        474,  475,  476,  477,  478,  479,  480,  481,  482,  483,  484,
        485,  486,  487,  488,  489,  490,  491,  492,  493,  494,  495,
        496,  497,  498,  499,  500,  501,  502,  503,  504,  505,  506,
        507,  508,  509,  510,  511,  512,  513,  514,  515,  516,  517,
        518,  519,  520,  521,  522,  523,  524,  525,  526,  527,  528,
        529,  530,  531,  532,  533,  534,  535,  536,  537,  538,  539,
        540,  541,  542,  543,  544,  545,  546,  547,  548,  549,  550,
        551,  552,  553,  554,  555,  556,  557,  558,  559,  560,  561,
        562,  563,  564,  565,  566,  567,  568,  569,  570,  571,  572,
        573,  574,  575,  576,  577,  578,  579,  580,  581,  582,  583,
        584,  585,  586,  587,  588,  589,  590,  591,  592,  593,  594,
        595,  596,  597,  598,  599,  600,  601,  602,  603,  604,  605,
        606,  607,  608,  609,  610,  611,  612,  613,  614,  615,  616,
        617,  618,  619,  620,  621,  622,  623,  624,  625,  626,  627,
        628,  629,  630,  631,  632,  633,  634,  635,  636,  637,  638,
        639,  640,  641,  642,  643,  644,  645,  646,  647,  648,  649,
        650,  651,  652,  653,  654,  655,  656,  657,  658,  659,  660,
        661,  662,  663,  664,  665,  666,  667,  668,  669,  670,  671,
        672,  673,  674,  675,  676,  677,  678,  679,  680,  681,  682,
        683,  684,  685,  686,  687,  688,  689,  690,  691,  692,  693,
        694,  695,  696,  697,  698,  699,  700,  701,  702,  703,  704,
        705,  706,  707,  708,  709,  710,  711,  712,  713,  714,  715,
        716,  717,  718,  719,  720,  721,  722,  723,  724,  725,  726,
        727,  728,  729,  730,  731,  732,  733,  734,  735,  736,  737,
        738,  739,  740,  741,  742,  743,  744,  745,  746,  747,  748,
        749,  750,  751,  752,  753,  754,  755,  756,  757,  758,  759,
        760,  761,  762,  763,  764,  765,  766,  767,  768,  769,  770,
        771,  772,  773,  774,  775,  776,  777,  778,  779,  780,  781,
        782,  783,  784,  785,  786,  787,  788,  789,  790,  791,  792,
        793,  794,  795,  796,  797,  798,  799,  800,  801,  802,  803,
        804,  805,  806,  807,  808,  809,  810,  811,  812,  813,  814,
        815,  816,  817,  818,  819,  820,  821,  822,  823,  824,  825,
        826,  827,  828,  829,  830,  831,  832,  833,  834,  835,  836,
        837,  838,  839,  840,  841,  842,  843,  844,  845,  846,  847,
        848,  849,  850,  851,  852,  853,  854,  855,  856,  857,  858,
        859,  860,  861,  862,  863,  864,  865,  866,  867,  868,  869,
        870,  871,  872,  873,  874,  875,  876,  877,  878,  879,  880,
        881,  882,  883,  884,  885,  886,  887,  888,  889,  890,  891,
        892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000])

In [39]:
times['rank'] = times['world_rank'].str.extract('(\d+)\-?\d*')
times['rank'] = pd.to_numeric(times['rank'])
shanghai['rank'] = shanghai['world_rank'].str.extract('(\d+)\-?\d*')
shanghai['rank'] = pd.to_numeric(shanghai['rank'])
rankings = pd.merge(times[['university_name', 'year', 'rank']], shanghai[['university_name', 'year', 'rank']], on = ['university_name', 'year'], suffixes = ('_times', '_shanghai'))
rankings = pd.merge(rankings, cwur[['university_name', 'year', 'world_rank']], on = ['university_name', 'year'])
rankings.rename(columns = {'world_rank' : 'rank_cwur'}, inplace = True)

In [47]:
times['world_rank_intervals'] = times['world_rank'].str.extract('(\d+)\-?\d*')
times.loc[pd.to_numeric(times['world_rank_intervals']) > 99] = (pd.to_numeric(times.loc[pd.to_numeric(times['world_rank_intervals']) > 99]['world_rank_intervals']) // 100) * 100

ValueError: ignored

In [42]:
times['world_rank_intervals'] = times['world_rank'].str.extract('(\d+)\-?\d*')
times.loc[(pd.to_numeric(times['world_rank_intervals']) > 99)] = pd.to_numeric(times['world_rank_intervals'] // 100 * 100

SyntaxError: ignored

In [ ]:
times_intervals = times['world_rank'].str.extract('(\d+)\-\d+').dropna()
times['world_rank_intervals'] = (pd.to_numeric(times_intervals[0]) // 100) * 100 
times.loc[times['world_rank_intervals'].isnull(), 'world_rank_intervals'] = times['world_rank']
times.loc[(pd.to_numeric(times['world_rank_intervals']) > 99) & (pd.to_numeric(times['world_rank_intervals']) < 200)] = 100
times

In [ ]:
shanghai_intervals = shanghai['world_rank'].str.extract('(\d+)\-\d+').dropna()
shanghai['world_rank_intervals'] = (pd.to_numeric(shanghai_intervals[0]) // 100) * 100 
shanghai.loc[shanghai['world_rank_intervals'].isnull(), 'world_rank_intervals'] = shanghai['world_rank']
shanghai

In [ ]:
party['percentage'] = party.apply(lambda riga: riga ['votes_first_votes' / risultato[riga['state']] * 100, axis = 1] )

bla bla

In [ ]:
times_no_intervals = times[~ times['world_rank'].str.contains('-')].copy()
times_no_intervals.tail()

In [ ]:
shanghai_no_intervals = shanghai[~ shanghai['world_rank'].str.contains('-')].copy()
shanghai_no_intervals.head()

Correzione dei valori di posizione nel ranking preceduti dal simbolo "=" contenuti nel dataframe "times_no_intervals".

In [ ]:
times_no_intervals['world_rank'] = times_no_intervals['world_rank'].str.extract('(\d+)$')
times_no_intervals.tail()

Join dei dataframe "times_no_intervals",  "shanghai_no_intervals" e "cwur".

In [ ]:
same_year_same_rank = pd.merge(times_no_intervals[['university_name', 'year', 'world_rank']], shanghai_no_intervals[['university_name', 'year', 'world_rank']], on = ['university_name', 'year'], suffixes = ('_times', '_shanghai'))
same_year_same_rank = pd.merge(same_year_same_rank, cwur[['university_name', 'year', 'world_rank']], on = ['university_name', 'year'])
same_year_same_rank.rename(columns = {'world_rank' : 'world_rank_cwur'}, inplace = True)
same_year_same_rank.head()

In [ ]:
same_year_same_rank[(pd.to_numeric(same_year_same_rank['world_rank_times']) == same_year_same_rank['world_rank_cwur'])
& (pd.to_numeric(same_year_same_rank['world_rank_shanghai']) == same_year_same_rank['world_rank_cwur'])]